app/Models/ModelHasil.php

SELECT *
FROM `saw_hasil`
---
    public function getAlternatif()
    {
        return $this->findAll();

INSERT INTO `saw_hasil` (`alternatif_terpilih`, `tanggal_penghitungan`) VALUES ('emina', '2023-08-05')
---
    public function insertAlternatifHasil($data)
    {
        return $this->insert($data);