app/Models/ModelAlternatif.php

    public function AllData()
    {
        return $this->orderBy('id', 'DESC')->get()->getResultArray();
---
SELECT *
FROM `saw_alternatif`
ORDER BY `id` DESC

    public function editAlternatif($data)
    {
        $this->set('nama_alternatif', $data['nama_alternatif'])->where('id', $data['id'])->update();
---
UPDATE `saw_alternatif` SET `nama_alternatif` = 'emina'
WHERE `id` = '13'

    public function hapusAlternatif($data)
    {
        $this->delete($data);
---
DELETE FROM `saw_alternatif`
WHERE `id` IN ('17')