app/Models/ModelKriteria.php

    public function AllData()
    {
        return $this->orderBy('id', 'DESC')->get()->getResultArray();
---
SELECT *
FROM `saw_kriteria`
ORDER BY `id` DESC

    public function EditKriteria($data)
    {
        $this->set([
            'nama_kriteria' => $data['nama_kriteria'],
            'penjelasan_kriteria' => $data['penjelasan_kriteria'],
            'bobot_kriteria' => $data['bobot_kriteria'],
            'kategori_bobot' => $data['kategori_bobot'],
        ])->where('id', $data['id'])->update();
---
UPDATE `saw_kriteria` SET `nama_kriteria` = 'Harga', `penjelasan_kriteria` = 'Semakin murah semakin mau dibeli', `bobot_kriteria` = '0.15', `kategori_bobot` = 'Cost'
WHERE `id` = '6'

    public function hapusKriteria($data)
    {
        $this->delete($data);
---
DELETE FROM `saw_kriteria`
WHERE `id` IN ('4')